Autodesk.Revit.DB.DirectShapeTypeUserAssignability
Since:
2023
Options for a DirectShapeType which affect whether or not it can be assigned as the type of a DirectShape.
Remarks:
Only DirectShapeTypes which permit assignability will be shown in the type selector dialog.
A DirectShape which uses a DirectShapeType which is not assignable can be copied.
Since:
2023

Autodesk.Revit.DB.DirectShapeTypeUserAssignability.Nonassignable
The DirectShapeType cannot be used to replace the type of an existing DirectShape.

Autodesk.Revit.DB.DirectShapeTypeUserAssignability.Assignable
The DirectShapeType can be used to replace the type of an existing DirectShape.